# EdgeArray Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArray Class
Members See Also
---
An array that contains edges.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class EdgeArray : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class EdgeArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class EdgeArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..EdgeArray
# See Also
EdgeArray Members
Autodesk.Revit.DB Namespace